{"metadata": "", "text": "Flux allows you to upload custom footprints and 3D models. It accepts KiCAD .mod or .kicad_mod files for footprints and .STEP or .stp files for 3D models. We plan on supporting more file formats in the future!"}
{"metadata": "", "text": "Open the part you'd like to add a footprint to and make sure you have edit access. If you don't, feel free to fork the part to make your own. Once you have the part open, click the canvas to make sure nothing is selected. First, we'll need to upload the footprint and/or 3D model assets in order to configure them."}
{"metadata": "", "text": 'On the right inspector, scroll down to the bottom under "assets" and click "manage". This will open a dialogue where you can add assets to the part. Click "Add Item" and then select your KiCAD .mod or .kicad_mod for footprints.'}
{"metadata": "", "text": 'If you want to upload a 3D model, use the same process by clicking "add item" and uploading a .STEP or .stp for 3D models. You should now see all of your assets in the right inspector.'}
{"metadata": "", "text": 'Now that you have your assets uploaded, let\'s configure them so they\'ll display. Click on the PCB view in the top nav bar to open the PCB editor. In the “Objects” panel on the left, right click on root folder and select "add" > "Footprint". This will create a new footprint object in the Objects panel.'}
{"metadata": "", "text": 'If you would like to add a 3D model do the same process by right clicking on the root and adding a "Model".'}
{"metadata": "", "text": 'After that, under "Objects" on the left again, click on the newly created “Footprint” under the root folder to select it.'}
{"metadata": "", "text": "On the right in the inspector, click “add rule” under “Object-specific rules”. In the popup, type “asset” and done. Then, in the asset input, search for the file name you used to upload the footprint"}
{"metadata": "", "text": "Then, in the asset rule input, search for the file name you used to upload the footprint. Click out of the box. You should now see your part’s footprint on the canvas!"}
{"metadata": "", "text": 'Do the exact same process for the 3D model and you should see a 3D model on your canvas as well when you hit the "3D" view on the bottom right.'}
{"metadata": "", "text": 'Sometimes the model\'s orientation isn\'t correct when it\'s imported. If this is the case, you can change the orientation of the 3D model by adding another object-specific rule. To do this, click on the 3D model in the object browser, then add another rule in the "Object-specific rules" section in the inspector on the right. This time, add a "Rotation" rule. The input uses an "X Y Z" input style, so for example if you wanted to rotate the model 90 degrees about the Y axis you would enter "0 90 0".}